using System;
using System.Collections.Generic;
using UnityEngine;

// ----------------------------------------------------------------------
// 全カードのデータを保持するモデル
// ----------------------------------------------------------------------
[Serializable]
public class AllCardModel
{
    public List<CardModel> cards;   // カードのリスト
    // ----------------------------------------------------------------------
    // プロパティ
    // ----------------------------------------------------------------------
    public List<CardModel> GetAllCards()
    {
        return cards;
    }
    // ----------------------------------------------------------------------
    // カードリストの取得
    // ----------------------------------------------------------------------
    public void SetCards(List<CardModel> newCards)
    {
        cards = newCards;
    } 
}
